validation/AMR/channelFlow/LES/SM/3D/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains  1;

decomposer          scotch;
distributor         scotch;

constraints
{
   patches
   {
        type    preservePatches;
        patches (inlet outlet front back);
        enabled true;
   }

   refinementHistory
   {
       type    refinementHistory;
   }
}

// ************************************************************************* //
